lesson19/blog/app/views/posts/_form.html.erb

  <div>
    <%= form.select :autor_id, Autor.all.map {|a| [a.name, a.id]} %>
---
SELECT "autors".* FROM "autors"