lesson18/Kolya_home_work/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("author", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["author", "nik"], ["body", "hgjgj"], ["created_at", "2022-06-21 15:40:05.966501"], ["updated_at", "2022-06-21 15:40:05.966501"]]