lesson19/blog/app/controllers/autors_controller.rb

SELECT "autors".* FROM "autors"
---
  def index
    @autors = Autor.all

INSERT INTO "autors" ("name", "city", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Olga"], ["city", "Dnepr"], ["age", 28], ["created_at", "2022-06-26 11:28:16.623907"], ["updated_at", "2022-06-26 11:28:16.623907"]]
---
  def create
    @autor = Autor.new(autor_params)

    respond_to do |format|
      if @autor.save

SELECT "autors".* FROM "autors" WHERE "autors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_autor
      @autor = Autor.find(params[:id])