lesson19/blog/app/controllers/comments_controller.rb

INSERT INTO "comments" ("autor_id", "post_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["autor_id", 1], ["post_id", 1], ["body", "bad post ugly."], ["created_at", "2022-06-26 12:21:30.140347"], ["updated_at", "2022-06-26 12:21:30.140347"]]
---
  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save

UPDATE "comments" SET "autor_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["autor_id", 2], ["updated_at", "2022-06-26 12:22:29.095094"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @comment.update(comment_params)