lesson19/blog/app/controllers/posts_controller.rb

INSERT INTO "posts" ("body", "created_at", "updated_at", "autor_id") VALUES (?, ?, ?, ?)  [["body", "hgfhgfjhfhgf"], ["created_at", "2022-06-26 11:56:47.678339"], ["updated_at", "2022-06-26 11:56:47.678339"], ["autor_id", 1]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save