dev_forms/app/controllers/articles_controller.rb

UPDATE "articles" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Cool Title"], ["body", "Very nice text "], ["updated_at", "2022-07-23 09:11:41.504766"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)