dev_forms/app/controllers/comments_controller.rb

INSERT INTO "comments" ("article_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["article_id", 1], ["body", "comment 1.1\n"], ["created_at", "2022-07-23 06:03:31.400080"], ["updated_at", "2022-07-23 06:03:31.400080"]]
---
  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save

UPDATE "comments" SET "body" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["body", "all right!"], ["updated_at", "2022-07-23 08:17:10.540386"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @comment.update(comment_params)