lesson19/rest/app/views/books/_form.html.erb

SELECT "authors".* FROM "authors"
---
    <%= form.label :author_id, style: "display: block" %>
    <%= form.select :author_id, Author.all.map {|a| [a.name, a.id]} %>