relation/app/controllers/artists_controller.rb

  def create
    @artist = Artist.new(artist_params)

    respond_to do |format|
      if @artist.save
---
INSERT INTO "artists" ("name", "age", "country", "lang", "created_at", "updated_at", "sex") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Ledy Gaga"], ["age", 38], ["country", "USA"], ["lang", "English"], ["created_at", "2022-06-30 18:49:07.998035"], ["updated_at", "2022-06-30 18:49:07.998035"], ["sex", "female"]]

  def update
    respond_to do |format|
      if @artist.update(artist_params)
---
UPDATE "artists" SET "name" = ?, "updated_at" = ? WHERE "artists"."id" = ?  [["name", "AlexMalcowich"], ["updated_at", "2022-06-30 18:34:54.428770"], ["id", 1]]