relation/app/controllers/songs_controller.rb

  def create
    @song = Song.new(song_params)

    respond_to do |format|
      if @song.save
---
INSERT INTO "songs" ("title", "artist_id", "size", "cathegory", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Bad romance"], ["artist_id", 3], ["size", 165], ["cathegory", "POP"], ["created_at", "2022-06-30 18:59:50.892900"], ["updated_at", "2022-06-30 18:59:50.892900"]]