project/app/controllers/admins_controller.rb

  def update
    respond_to do |format|
      if @admin.update(admin_params)
---
UPDATE "admins" SET "name" = ?, "age" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["name", "Lexa"], ["age", 33], ["updated_at", "2022-07-29 10:02:07.912216"], ["id", 1]]