project/app/controllers/news_controller.rb

SELECT "new_posts".* FROM "new_posts"
---
  def list
    @list = NewPost.all