project/app/controllers/spares_controller.rb

SELECT "spares".* FROM "spares"
---
  def index
    @spares = Spare.all

INSERT INTO "spares" ("name", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "rrr"], ["price", nil], ["created_at", "2022-08-03 14:16:32.006421"], ["updated_at", "2022-08-03 14:16:32.006421"]]
---
  def create
    @spare = Spare.new(spare_params)
    @spare.picture.attach(spare_params[:picture])
    respond_to do |format|
      if @spare.save

UPDATE "spares" SET "price" = ?, "updated_at" = ? WHERE "spares"."id" = ?  [["price", 555], ["updated_at", "2022-08-03 14:16:57.800681"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @spare.update(spare_params)

SELECT "spares".* FROM "spares" WHERE "spares"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_spare
      @spare = Spare.find(params[:id])