lesson18/my_project/app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("author", "description", "developers_count", "platform", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["author", "Yana"], ["description", "First pro"], ["developers_count", 1], ["platform", "Ruby on Rails"], ["created_at", "2022-06-23 13:44:35.119111"], ["updated_at", "2022-06-23 13:44:35.119111"]]