# Написать клас для хранения информации по постам
# (например в фейсбуке). В этом классе один пост
# должен иметь такие поля :author, :title, :text, :date
# :date - время и дата когда был создан (Использовать Time.now)
# В классе должны быть такие методы
#  - добавить пост в общий массив постов
#  - отсортировать посты от самого короткого до самог длинного
#  - отсортировать от самого свежего до самого позднего
#
# программа должна иметь меню с такими пунктами
# выводить один пост
# - первоя строка должна содержать :author, :title, :date
# - вторая содержать :text и черта после текста для разделения
# выводить все посты
# Выводить пасты отсортерованные по размеру
# выводить посты остортированные по дате
