lesson19/rest/app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "body", "author_id", "page_count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Foundation"], ["body", "Cool adventure"], ["author_id", 2], ["page_count", 900], ["created_at", "2022-06-26 10:08:02.694675"], ["updated_at", "2022-06-26 10:08:02.694675"]]