relation/app/views/songs/_form.html.erb

SELECT "artists".* FROM "artists"
---
    <%= form.label :artist_id, style: "display: block" %>
    <%= form.select :artist_id, Artist.all.map{|a| [a.name, a.id]} %>