lesson19/blog/app/views/comments/_form.html.erb

SELECT "autors".* FROM "autors"
---
  <div>
    <%= form.select :autor_id, Autor.all.map {|a| [a.name, a.id]} %>

SELECT "posts".* FROM "posts"
---
  <div>
    <%= form.select :post_id, Post.all.map {|a| [a.body.first(15), a.id]} %>